data/cfdb/validation/natural_convection_cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// de Vahl Davis (1983) differentially-heated square cavity.
// Unit square H=1 m, hot wall at x=0, cold wall at x=1,
// adiabatic top/bottom, 2D (empty front/back). 64x64 uniform demo mesh.

scale   1;

vertices
(
    (0    0    0)      // 0
    (1    0    0)      // 1
    (1    1    0)      // 2
    (0    1    0)      // 3
    (0    0    0.01)   // 4
    (1    0    0.01)   // 5
    (1    1    0.01)   // 6
    (0    1    0.01)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 64 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    hotWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    coldWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    adiabaticWalls
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
