data/cfdb/validation/natural_convection_cavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
    }
    coldWall
    {
        type            fixedFluxPressure;
    }
    adiabaticWalls
    {
        type            fixedFluxPressure;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
