data/cfdb/validation/natural_convection_cavity/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

// Start at the mean temperature: linear-conduction profile would be fine
// too, but the mean is a robust neutral start for the buoyancy loop.
internalField   uniform 288;

boundaryField
{
    hotWall
    {
        type            fixedValue;
        value           uniform 293;
    }
    coldWall
    {
        type            fixedValue;
        value           uniform 283;
    }
    adiabaticWalls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
